app/controllers/session_controller.rb

  def create
    user = User.find_by email: params[:session][:email].downcase
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'example@railstutorial.org' LIMIT 1